app/controllers/api/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 3]]
---
  def show
    @profile = Profile.find_by_user_id(params[:id])

UPDATE "profiles" SET "about_blurb" = $1, "story_blurb" = $2, "travel_blurb" = $3, "updated_at" = $4 WHERE "profiles"."id" = $5  [["about_blurb", "sdgasdvbeadivkn"], ["story_blurb", "asld;kbah;nsdglkf"], ["travel_blurb", "asl;bia;ewtsdg"], ["updated_at", "2015-06-10 18:16:15.004738"], ["id", 2]]
---
  def update
    @profile = current_user.profile
    if @profile.update_attributes(profile_params)