app/controllers/api/trips_controller.rb

INSERT INTO "trips" ("start_date", "end_date", "from_city_zip", "to_city_zip", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @trip = Trip.new(trip_params)
    @trip.owner_id = current_user.id
    if @trip.save